app/Models/ProgramModel.php

UPDATE `projectci4`.`programme_info` SET `progTitle` = 'updated', `targetGroup` = 'TG-2', `date` = '2024-12-09', `progDirector` = 'PD-2', `dealingAsstt` = 'DA-2', `materialLink` = 'no link', `paymentdone` = 'yes'
WHERE `prog_id` = '348'
---
    public function updateDetailsModel($data, $id)
    {
        // print_r('$aaaaaaaaaaaaaaaaaaa');
        // // print_r($data);
        // print_r($id);
        // die;

        $query = $this->db->table('projectci4.programme_info');
        $query->where('prog_id', $id);
        $query->update($data);